src/slides/05-estrutura-agente.org
#+TITLE: Estrutura de um Agente
#+AUTHOR: Lucas S. Vieira
#+SUBTITLE: Construindo o primeiro agente
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js@4/
#+REVEAL_THEME: night
#+REVEAL_PLUGINS: (highlight)
#+REVEAL_MARGIN: 0.1
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.0
#+OPTIONS: toc:nil num:nil
#+REVEAL_TITLE_SLIDE: <p style="font-size:0.7em;opacity:0.6;">%a</p><br/><h2>%t</h2><br/><p style="font-size:0.85em;opacity:0.8;">%s</p><br/><p style="font-size:0.9em;color:#FFB033;">Guilda de IA</p>
#+REVEAL_TITLE_SLIDE_BACKGROUND: ./slide_05.gif

* O que é um agente?

#+ATTR_REVEAL: :frag (appear)
Agente = LLM + estrutura para conversar

#+ATTR_REVEAL: :frag (appear)
O LLM puro só responde uma pergunta. Um agente:
- Lembra da conversa (memória)
- Tem personalidade (instruções)
- Pode usar ferramentas (extensões)

* Componentes do agente

** 1. Instruções (System)
Define quem o agente é.

#+BEGIN_SRC python
instrucoes = "Você é um assistente educado e objetivo."
#+END_SRC

** 2. Histórico (Memory)
Guarda a conversa.

#+BEGIN_SRC python
historico = [
    {"role": "usuário", "content": "Oi!"},
    {"role": "assistente", "content": "Olá! Como posso ajudar?"}
]
#+END_SRC

** 3. Mensagem (Input)
A pergunta atual.

** 4. Resposta (Output)
A resposta do modelo.

* Estrutura com funções

#+BEGIN_SRC python
def criar_agente(instrucoes):
    return {
        "instrucoes": instrucoes,
        "historico": []
    }

def conversar(agente, mensagem):
    # Monta prompt
    # Chama LLM
    # Salva no histórico (agente["historico"].append(...))
    # Retorna resposta
#+END_SRC

* Por que estado separado?

#+ATTR_REVEAL: :frag (appear)
Estado em dicionário = mais simples para iniciantes.

Funções puras são mais fáceis de testar e entender.

** Com funções:

#+BEGIN_SRC python
agente = criar_agente("Você é educado.")
conversar(agente, "Oi")       # histórico atualiza
conversar(agente, "Lembra o que eu disse?")  # tem contexto
#+END_SRC

* O problema do histórico infinito

#+ATTR_REVEAL: :frag (appear)
Se a conversa crescer demais, o prompt fica gigante.

**Solução:** limitar histórico.

#+BEGIN_SRC python
# Pegar só as últimas 10 trocas
for msg in agente["historico"][-10:]:
    ...
#+END_SRC

* Diagrama

#+BEGIN_SRC text
Usuário → Agente → LLM → Resposta
           ↑                |
           |                |
           └──── Histórico ←┘
#+END_SRC

#+ATTR_REVEAL: :frag (appear)
1. Usuário envia mensagem
2. Agente monta prompt com histórico
3. LLM processa
4. Resposta salva no histórico
5. Retorna ao usuário

* Para lembrar

#+ATTR_REVEAL: :frag (appear)
#+begin_quote
"Agente é LLM com memória e personalidade."
#+end_quote

* Próxima semana

#+ATTR_REVEAL: :frag (appear)
- Vamos dar uma ferramenta para o agente
- Calculadora
- Tool calling básico

* Perguntas?