slides/05-estrutura-agente.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Estrutura de um Agente</title>
<meta name="author" content="Lucas S. Vieira"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/theme/night.css" id="theme"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/plugin/highlight/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide" data-background="./slide_05.gif"><p style="font-size:0.7em;opacity:0.6;">Lucas S. Vieira</p><br/><h2>Estrutura de um Agente</h2><br/><p style="font-size:0.85em;opacity:0.8;">Construindo o primeiro agente</p><br/><p style="font-size:0.9em;color:#FFB033;">Guilda de IA</p>
</section>
<section>
<section id="slide-org0fd873c">
<h2 id="org0fd873c">O que é um agente?</h2>
<p class="fragment (appear)">
Agente = LLM + estrutura para conversar
</p>

<p class="fragment (appear)">
O LLM puro só responde uma pergunta. Um agente:
</p>
<ul>
<li>Lembra da conversa (memória)</li>
<li>Tem personalidade (instruções)</li>
<li>Pode usar ferramentas (extensões)</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgd9cbe14">
<h2 id="orgd9cbe14">Componentes do agente</h2>
<div class="outline-text-2" id="text-orgd9cbe14">
</div>
</section>
<section id="slide-org1b7e39e">
<h3 id="org1b7e39e">1. Instruções (System)</h3>
<p>
Define quem o agente é.
</p>

<div class="org-src-container">

<pre   ><code class="python" >instrucoes = "Você é um assistente educado e objetivo."
</code></pre>
</div>
</section>
<section id="slide-orga0be5f1">
<h3 id="orga0be5f1">2. Histórico (Memory)</h3>
<p>
Guarda a conversa.
</p>

<div class="org-src-container">

<pre   ><code class="python" >historico = [
    {"role": "usuário", "content": "Oi!"},
    {"role": "assistente", "content": "Olá! Como posso ajudar?"}
]
</code></pre>
</div>
</section>
<section id="slide-org1499427">
<h3 id="org1499427">3. Mensagem (Input)</h3>
<p>
A pergunta atual.
</p>
</section>
<section id="slide-org4c6dab2">
<h3 id="org4c6dab2">4. Resposta (Output)</h3>
<p>
A resposta do modelo.
</p>
</section>
</section>
<section>
<section id="slide-org27963e4">
<h2 id="org27963e4">Estrutura com funções</h2>
<div class="org-src-container">

<pre   ><code class="python" >def criar_agente(instrucoes):
    return {
        "instrucoes": instrucoes,
        "historico": []
    }

def conversar(agente, mensagem):
    # Monta prompt
    # Chama LLM
    # Salva no histórico (agente["historico"].append(...))
    # Retorna resposta
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org84be0b6">
<h2 id="org84be0b6">Por que estado separado?</h2>
<p class="fragment (appear)">
Estado em dicionário = mais simples para iniciantes.
</p>

<p>
Funções puras são mais fáceis de testar e entender.
</p>
</section>
<section id="slide-orgf18afbb">
<h3 id="orgf18afbb">Com funções:</h3>
<div class="org-src-container">

<pre   ><code class="python" >agente = criar_agente("Você é educado.")
conversar(agente, "Oi")       # histórico atualiza
conversar(agente, "Lembra o que eu disse?")  # tem contexto
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org7122b9b">
<h2 id="org7122b9b">O problema do histórico infinito</h2>
<p class="fragment (appear)">
Se a conversa crescer demais, o prompt fica gigante.
</p>

<p>
<b><b>Solução:</b></b> limitar histórico.
</p>

<div class="org-src-container">

<pre   ><code class="python" ># Pegar só as últimas 10 trocas
for msg in agente["historico"][-10:]:
    ...
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-orgfe98a20">
<h2 id="orgfe98a20">Diagrama</h2>
<div class="org-src-container">

<pre   ><code class="text" >Usuário → Agente → LLM → Resposta
           ↑                |
           |                |
           └──── Histórico ←┘
</code></pre>
</div>

<ol>
<li class="fragment appear">Usuário envia mensagem</li>
<li class="fragment appear">Agente monta prompt com histórico</li>
<li class="fragment appear">LLM processa</li>
<li class="fragment appear">Resposta salva no histórico</li>
<li class="fragment appear">Retorna ao usuário</li>

</ol>
</section>
</section>
<section>
<section id="slide-org70a9727">
<h2 id="org70a9727">Para lembrar</h2>
<blockquote  class="fragment (appear)">
<p>
"Agente é LLM com memória e personalidade."
</p>
</blockquote>
</section>
</section>
<section>
<section id="slide-org5ddc25a">
<h2 id="org5ddc25a">Próxima semana</h2>
<ul>
<li class="fragment appear">Vamos dar uma ferramenta para o agente</li>
<li class="fragment appear">Calculadora</li>
<li class="fragment appear">Tool calling básico</li>

</ul>
</section>
</section>
<section>
<section id="slide-org24f06a7">
<h2 id="org24f06a7">Perguntas?</h2>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@4/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } }]

});

</script>
</body>
</html>
